Marks100/STM32_RFM69_receiver/test/unit_test/test_AIRCON.c
//-- unity: unit test framework
#include "unity.h"

#include "C_defs.h"
#include "Compiler_defs.h"
#include "CHKSUM.h"
#include "STDC.h"
#include "NVM.h"

#include "STM32_stubs.h"

//-- module being tested
#include "AIRCON.h"



/*******************************************************************************
 *    DEFINITIONS
 ******************************************************************************/


/*******************************************************************************
 *     Variables
 ******************************************************************************/

extern NVM_info_st       NVM_info_s;
extern AIRCON_config_st  AIRCON_config_s;
extern disable_enable_et AIRCON_generic_outputs_s[MAX_NUM_OUTPUTS];
extern AIRCON_min_max_st AIRCON_min_max_s;

/*******************************************************************************
 *    SETUP, TEARDOWN
 ******************************************************************************/

void setUp(void)
{
    NVM_info_s.NVM_generic_data_blk_s.aircon_mode = DISABLE_;
    NVM_info_s.NVM_generic_data_blk_s.cool_target_temp = 19.0;
    NVM_info_s.NVM_generic_data_blk_s.heat_target_temp = 16.0;
    NVM_info_s.NVM_generic_data_blk_s.aircon_state = DISABLE_;
    NVM_info_s.NVM_generic_data_blk_s.auto_target_temp = 18.5;
}

void tearDown(void)
{
}

/*******************************************************************************
 *    TESTS
 ******************************************************************************/


void test_init(void)
{
	AIRCON_init();

	TEST_ASSERT_EQUAL( 18.5, AIRCON_config_s.auto_target_temp_c );
    TEST_ASSERT_EQUAL( 19.0, AIRCON_config_s.cool_target_temp_c );
    TEST_ASSERT_EQUAL( 16.0, AIRCON_config_s.heat_target_temp_c );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
    TEST_ASSERT_EQUAL( 0.5, AIRCON_config_s.hysteresis );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.mode );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_get_oat() );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.state );
}


void test_outputs_are_disabled_when_system_off( void )
{
    AIRCON_config_s.state = DISABLE_;

    AIRCON_config_s.oat_c = 0.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 10.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 100.0;
    AIRCON_tick();
    AIRCON_tick();
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE, AIRCON_config_s.heater_state );
}

void test_heater_is_off_when_fan_is_on( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  AIRCON_COOL_MODE;

    AIRCON_config_s.oat_c = 0.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 10.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 100.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 18.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
}

void test_fan_is_off_when_heater_is_on( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  AIRCON_HEAT_MODE;

    AIRCON_config_s.oat_c = 0.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 10.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 100.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 20.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
}

void test_auto_mode_wide_swings_in_temp( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  AIRCON_AUTO_MODE;
    AIRCON_config_s.auto_target_temp_c = 20.0;

    AIRCON_config_s.oat_c = 0.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

