Marks100/STM32_RFM69_receiver/test/unit_test/test_AIRCON.c
    AIRCON_config_s.oat_c = 10.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 100.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = -40.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.oat_c = 20.0;
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
}



void test_temp_invalid( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  AIRCON_AUTO_MODE;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.oat_c = 20.0;

    AIRCON_set_oat(0, 0x0001);
    TEST_ASSERT_EQUAL(0, AIRCON_config_s.oat_c );
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( ENABLE_, AIRCON_config_s.heater_state );

    AIRCON_set_oat(-100, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_set_oat(110, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.mode =  AIRCON_HEAT_MODE;
    AIRCON_set_oat(110, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_set_oat(-110, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_config_s.mode =  AIRCON_COOL_MODE;
    AIRCON_set_oat(110, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_set_oat(-55, 0x0001);
    TEST_ASSERT_EQUAL(TMPERATURE_INVALID, AIRCON_config_s.oat_c );
    AIRCON_tick();
    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
}

void test_modes( void )
{
    AIRCON_config_s.oat_c = 20.0;
    AIRCON_set_mode(AIRCON_HEAT_MODE);
    TEST_ASSERT_EQUAL(AIRCON_HEAT_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_HEAT_MODE, AIRCON_config_s.mode );

    AIRCON_set_mode(AIRCON_COOL_MODE);
    TEST_ASSERT_EQUAL(AIRCON_COOL_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_COOL_MODE, AIRCON_config_s.mode );

    AIRCON_set_mode(AIRCON_AUTO_MODE);
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );

    AIRCON_set_mode(100);
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );


    AIRCON_set_mode(AIRCON_AUTO_MODE);
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
    
    AIRCON_toggle_mode();  
    TEST_ASSERT_EQUAL(AIRCON_HEAT_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_HEAT_MODE, AIRCON_config_s.mode );

    AIRCON_toggle_mode();  
    TEST_ASSERT_EQUAL(AIRCON_COOL_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_COOL_MODE, AIRCON_config_s.mode );

    AIRCON_toggle_mode();  
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(AIRCON_AUTO_MODE, AIRCON_config_s.mode );
}


void test_state( void )
{
    AIRCON_config_s.state = DISABLE_;
    AIRCON_config_s.mode =  AIRCON_AUTO_MODE;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.oat_c = 20.0;

    AIRCON_set_state( ENABLE_ );
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );

    AIRCON_set_state( DISABLE_ );
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );

    AIRCON_set_state( 100 );
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );

    AIRCON_toggle_state();
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );

    AIRCON_toggle_state();
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(DISABLE_, AIRCON_get_state() );

    AIRCON_toggle_state();
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );
    AIRCON_tick();
    TEST_ASSERT_EQUAL(ENABLE_, AIRCON_get_state() );
}

void test_outputs_default_case( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  100;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.oat_c = 20.0;

    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );

    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
}


void test_generic_outputs( void )
{
    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  100;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.oat_c = 20.0;

    u8_t i;

    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
    for( i = 0u; i < MAX_NUM_OUTPUTS; i++ )
    {
        TEST_ASSERT_EQUAL( DISABLE_, AIRCON_generic_outputs_s[i] );
    }


    AIRCON_tick();
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.cooler_state );
    TEST_ASSERT_EQUAL( DISABLE_, AIRCON_config_s.heater_state );
 }


void test_min_max_tracking( void )
{
    AIRCON_init();
    float temperature_val ;

    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  100;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.oat_c = 20.0;

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    AIRCON_tick();

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    temperature_val = -50.1;
    AIRCON_set_oat(temperature_val, 0x0001);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    temperature_val = 100.1;
    AIRCON_set_oat( temperature_val, 0x0001);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

