Marks100/STM32_RFM69_receiver/test/unit_test/test_AIRCON.c
    temperature_val = 25.0;
    AIRCON_set_oat( temperature_val, 0x0001);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( temperature_val, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 1, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( temperature_val, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 1, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    temperature_val = 24.9;
    AIRCON_set_oat( temperature_val, 0x0002);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( 25.0, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 1, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( 24.9, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0.1, AIRCON_min_max_s.temp_delta_c );

    temperature_val = 27.0;
    AIRCON_set_oat( temperature_val, 0x0002);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( temperature_val, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( 24.9, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.temp_delta_c );

    temperature_val = 21.0;
    AIRCON_set_oat( temperature_val, 0x0003);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( 27.0, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( temperature_val, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 3, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 6, AIRCON_min_max_s.temp_delta_c );

    temperature_val = 13.0;
    AIRCON_set_oat( temperature_val, 0x0002);
    AIRCON_tick();

    TEST_ASSERT_EQUAL( 27.0, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( temperature_val, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 2, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 14, AIRCON_min_max_s.temp_delta_c );
}


void test_get_temp_setting( void )
{
    AIRCON_init();
    float temperature_val ;

    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  100;
    AIRCON_config_s.auto_target_temp_c = 20.0;
    AIRCON_config_s.cool_target_temp_c = 15.5;
    AIRCON_config_s.heat_target_temp_c = 18.5;
    AIRCON_config_s.oat_c = 20.0;

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    AIRCON_tick();

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    TEST_ASSERT_EQUAL( 18.5, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_EQUAL( 15.5, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_EQUAL( 20.0, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );
}


void test_AIRCON_adjust_temperature_setting( void )
{
    AIRCON_init();
    float temperature_val ;

    AIRCON_config_s.state = ENABLE_;
    AIRCON_config_s.mode =  100;
    AIRCON_config_s.auto_target_temp_c = 5.0;
    AIRCON_config_s.cool_target_temp_c = 6.5;
    AIRCON_config_s.heat_target_temp_c = 7.5;
    AIRCON_config_s.oat_c = 20.0;

    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.max_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.max_temp_c.id );
    TEST_ASSERT_EQUAL( TMPERATURE_NOT_AVAILABLE, AIRCON_min_max_s.min_temp_c.value );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.min_temp_c.id );
    TEST_ASSERT_EQUAL( 0, AIRCON_min_max_s.temp_delta_c );

    /* Auto temp settings */
    TEST_ASSERT_EQUAL( 7.5, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_EQUAL( 6.5, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_EQUAL( 5.0, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_AUTO_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_AUTO_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + STEP_VALUE, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_AUTO_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + ( STEP_VALUE * 2u ), AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    u8_t i = 0;
    for( i = 0u; i < 100; i++ )
    {
        AIRCON_adjust_temperature_setting( AIRCON_AUTO_MODE, SETTING_ADJUST_UP );
    }
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MAX_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );



    /* heat temp settings */

