Marks100/STM32_RFM69_receiver/test/unit_test/test_AIRCON.c
    AIRCON_config_s.auto_target_temp_c = 5.0;
    AIRCON_config_s.cool_target_temp_c = 6.5;
    AIRCON_config_s.heat_target_temp_c = 7.5;

    TEST_ASSERT_EQUAL( 7.5, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_EQUAL( 6.5, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_EQUAL( 5.0, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_HEAT_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_HEAT_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + STEP_VALUE, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_HEAT_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + ( STEP_VALUE * 2u ), AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    for( i = 0u; i < 100; i++ )
    {
        AIRCON_adjust_temperature_setting( AIRCON_HEAT_MODE, SETTING_ADJUST_UP );
    }
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MAX_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );


    /* cool temp settings */
    AIRCON_config_s.auto_target_temp_c = 5.0;
    AIRCON_config_s.cool_target_temp_c = 6.5;
    AIRCON_config_s.heat_target_temp_c = 7.5;

    TEST_ASSERT_EQUAL( 7.5, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_EQUAL( 6.5, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_EQUAL( 5.0, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_COOL_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_COOL_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + STEP_VALUE, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    AIRCON_adjust_temperature_setting( AIRCON_COOL_MODE, SETTING_ADJUST_UP );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING + ( STEP_VALUE * 2u ), AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );

    for( i = 0u; i < 100; i++ )
    {
        AIRCON_adjust_temperature_setting( AIRCON_COOL_MODE, SETTING_ADJUST_UP );
    }
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_HEAT_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MAX_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_COOL_MODE ) );
    TEST_ASSERT_FLOAT_WITHIN( 0.1, MIN_AIRCON_TEMP_C_SETTING, AIRCON_get_temperature_setting( AIRCON_AUTO_MODE ) );
}



void test_AIRCON_get_heater_state( void )
{
    AIRCON_config_s.heater_state = AIRCON_HEAT_MODE;
    TEST_ASSERT_EQUAL( AIRCON_HEAT_MODE, AIRCON_get_heater_state() );

    AIRCON_config_s.heater_state = AIRCON_COOL_MODE;
    TEST_ASSERT_EQUAL( AIRCON_COOL_MODE, AIRCON_get_heater_state() );

    AIRCON_config_s.heater_state = AIRCON_AUTO_MODE;
    TEST_ASSERT_EQUAL( AIRCON_AUTO_MODE, AIRCON_get_heater_state() );
}































void NVM_tick( void ){}
void HAL_BRD_toggle_debug_pin( void ){}

low_high_et HAL_BRD_read_selector_switch_pin( HAL_BRD_switch_slider_et slider )
{
	(void)slider;
	
	return( 0 );
}

void HAL_BRD_set_LED_state( HAL_BRD_led_et led, low_high_et state )
{
    (void)led;
    (void)state;
}

void HAL_BRD_set_generic_output( u8_t generic_output_num, off_on_et state )
{
    (void)generic_output_num;
    (void)state;
}

